presentation/index.org
#+TITLE: Kickhub
#+AUTHOR: @bzg2

* Les problèmes

** Côté technique

Un système de don *différent* à chaque fois.

** Côté éthique

- Manque de visibilité sur les dons existants.

- Confier ses données bancaires à un site ?

- Paypal?!

* Kickhub : l'idée principale

** Donation et crowdfunding

... même combat !

** Méta-système

... pour rendre les dons *visibles*

** Mutualiser les possibilités de financement

... a.k.a. /reverse crowdfunding/

* Défis

** Centralisation ?

** Modèle économique (Ramen) ?

** (Pseudo)-anonymat ?

* Kickhub : communauté

** Listes de discussion

- =users@lists.kickhub.com=
- =users-fr@lists.kickhub.com=

** FLOSS GNU AGPL

- http://github.com/bgz/kickhub
- http://docs.kickhub.com
- http://beta.kickhub.com

* KickHub stack

** Server

- Debian 7
- mailman
- Immutant (Jboss)
- nginx
- =http= and =https=

** Clojure

#+BEGIN_SRC clojure
(ns kickhub.core
  (:require [cemerick.friend :as friend]
            [cemerick.friend.workflows :as workflows]
            [clojurewerkz.scrypt.core :as sc]
            [compojure.core :refer [GET POST defroutes]]
            [compojure.route :as route]
            [friend-oauth2.workflow :as oauth2]
            [friend-oauth2.util :as oauth2-util]
            [kickhub.html.templates :refer :all]
            [kickhub.model :refer :all]
            [kickhub.github :refer :all]
            [noir.util.middleware :as middleware]
            [ring.util.response :as resp]
            [ring.util.codec :as codec]))
#+END_SRC


